elliotwainwright-LJMUHolidays-a635971/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password_salt", "password_hash", "email") VALUES('2012-01-19 20:14:53', '2012-01-19 20:14:53', 'Elliot', 'de167df22163eef572582e14621b3a0b5e9e534a', 'bb19f4fb2be52960ac457013be95e339e0d17e00', 'me@elliotwainwright.com')